orosys/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
              }
              
              // trigger system identification
              if (dap_actions_st.payloadPedalAction_.startSystemIdentification_u8)
              {
                systemIdentificationMode_b = true;
              }
              // trigger Custom effect effect 1
              if (dap_actions_st.payloadPedalAction_.Trigger_CV_1)
              {
                CV1.trigger();
              }
              // trigger Custom effect effect 2
              if (dap_actions_st.payloadPedalAction_.Trigger_CV_2)
              {
                CV2.trigger();
              }
              // trigger return pedal position
              if (dap_actions_st.payloadPedalAction_.returnPedalConfig_u8)
              {
               
                DAP_config_st * dap_config_st_local_ptr;
                dap_config_st_local_ptr = &sct_dap_config_st;
                crc = checksumCalculator((uint8_t*)(&(sct_dap_config_st.payLoadHeader_)), sizeof(sct_dap_config_st.payLoadHeader_) + sizeof(sct_dap_config_st.payLoadPedalConfig_));
                dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
                Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
                Serial.print("\r\n");
              }
              #ifdef ESPNOW_Enable
                if(dap_actions_st.payloadPedalAction_.Rudder_action==1)//Enable Rudder
                {
                  if(dap_calculationVariables_st.Rudder_status==false)
                  {
                    dap_calculationVariables_st.Rudder_status=true;
                    Serial.println("Rudder on");
                    Rudder_initializing=true;
                    moveSlowlyToPosition_b=true;
                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                  else
                  {
                    dap_calculationVariables_st.Rudder_status=false;
                    Serial.println("Rudder off");
                    Rudder_deinitializing=true;
                    moveSlowlyToPosition_b=true; 

                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                }
                if(dap_actions_st.payloadPedalAction_.Rudder_brake_action==1)
                {
                  if(dap_calculationVariables_st.rudder_brake_status==false&&dap_calculationVariables_st.Rudder_status==true)
                  {
                    dap_calculationVariables_st.rudder_brake_status=true;
                    Serial.println("Rudder brake on");
                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                  else
                  {
                    dap_calculationVariables_st.rudder_brake_status=false;
                    Serial.println("Rudder brake off");
                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                }
                //clear rudder status
                if(dap_actions_st.payloadPedalAction_.Rudder_action==2)
                {
                  dap_calculationVariables_st.Rudder_status=false;
                  dap_calculationVariables_st.rudder_brake_status=false;
                  Serial.println("Rudder Status Clear");
                  Rudder_deinitializing=true;
                  moveSlowlyToPosition_b=true;

                }
              #endif


            }

            break;
          case sizeof(DAP_otaWifiInfo_st) : 
          Serial.println("get basic wifi info");
          Serial.readBytes((char*)&_dap_OtaWifiInfo_st, sizeof(DAP_otaWifiInfo_st));
          #ifdef OTA_update
            if(_dap_OtaWifiInfo_st.device_ID == sct_dap_config_st.payLoadPedalConfig_.pedal_type)
            {
              SSID=new char[_dap_OtaWifiInfo_st.SSID_Length+1];
              PASS=new char[_dap_OtaWifiInfo_st.PASS_Length+1];
              memcpy(SSID,_dap_OtaWifiInfo_st.WIFI_SSID,_dap_OtaWifiInfo_st.SSID_Length);
              memcpy(PASS,_dap_OtaWifiInfo_st.WIFI_PASS,_dap_OtaWifiInfo_st.PASS_Length);
              SSID[_dap_OtaWifiInfo_st.SSID_Length]=0;
              PASS[_dap_OtaWifiInfo_st.PASS_Length]=0;
              OTA_enable_b=true;
            }
          #endif
          #ifdef OTA_update_ESP32
            Serial.println("Get OTA command");
            OTA_enable_b=true;
            //OTA_enable_start=true;
            ESPNow_OTA_enable=false;
            //Serial.println("get basic wifi info");
            //Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
          #endif
          
          break;
          default:

            // flush the input buffer
            while (Serial.available()) Serial.read();
            //Serial.flush();

            Serial.println("\nIn byte size: ");
            Serial.println(n);
            Serial.println("    Exp config size: ");
            Serial.println(sizeof(DAP_config_st) );
            Serial.println("    Exp action size: ");
            Serial.println(sizeof(DAP_actions_st) );

            break;  


            

        }
      }


      // start profiler 1, serial read
      profiler_serialCommunicationTask.end(1);

      // start profiler 2, serial send
      profiler_serialCommunicationTask.start(2);


      // send pedal state structs
      // update pedal states
      printCycleCounter++;
      DAP_state_basic_st dap_state_basic_st_lcl;
      DAP_state_extended_st dap_state_extended_st_lcl;
        
      // initialize with zeros in case semaphore couldn't be aquired
      memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
      memset(&dap_state_extended_st_lcl, 0, sizeof(dap_state_extended_st_lcl));


      if(semaphore_updatePedalStates!=NULL)
      {
        
        if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)1)==pdTRUE) 
        {
        
          // UPDATE basic pedal state struct
          dap_state_basic_st_lcl = dap_state_basic_st;

